In [62]:
import pandas as pd
import numpy as np

In [63]:
df = pd.DataFrame({'A': [0, 1, 2, 3, 4],
                   'B': ['foo', 'bar', 'bloo', 'blee', 'bloo'],
                   'C': ['green', 'red', 'blue', 'yellow', 'green']})

In [64]:
df

   A     B       C
0  0   foo   green
1  1   bar     red
2  2  bloo    blue
3  3  blee  yellow
4  4  bloo   green

In [65]:
df['A'] = df['A'].replace([df['A'] > 2], 0)

In [66]:
df

   A     B       C
0  0   foo   green
1  0   bar     red
2  2  bloo    blue
3  3  blee  yellow
4  4  bloo   green

In [67]:
#df['A'] = df['A'].mask([df['A'] > 2], 0)
df['A'] = df['A'].mask(df['A'] > 3, 0)

In [68]:
df

   A     B       C
0  0   foo   green
1  0   bar     red
2  2  bloo    blue
3  3  blee  yellow
4  0  bloo   green

In [80]:
df['A'] = np.where(df['A'].between(0,2), 0, df['A'])

In [76]:
df

   A     B       C
0  0   foo   green
1  0   bar     red
2  0  bloo    blue
3  0  blee  yellow
4  0  bloo   green

In [77]:
df = pd.DataFrame({'A': [0, 1, 2, 3, 4],
                   'B': ['foo', 'bar', 'bloo', 'blee', 'bloo'],
                   'C': ['green', 'red', 'blue', 'yellow', 'green']})

In [78]:
df.loc[df['A'] > 2, 'A'] = 0

In [79]:
df

   A     B       C
0  0   foo   green
1  1   bar     red
2  2  bloo    blue
3  0  blee  yellow
4  0  bloo   green

[good source](https://www.python-course.eu/pandas_replacing_values.php)

[masking](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.mask.html)